In [18]:
from sklearn.datasets import load_diabetes
import pandas as pd
import numpy as np

df = pd.read_csv("Titanic-Dataset.csv")

In [19]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [20]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [22]:
df.drop(columns = ['Cabin'], inplace = True)

In [23]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [27]:
df['Age'] = df['Age'].fillna(df['Age'].mean())
df['Embarked'] = df['Embarked'].fillna(df['Embarked'].mode()[0])

In [28]:
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [35]:
# Step 1
# H0 : average age of person on titanic ship is 27
# H1 : average age of person on titanic ship is less than 27

In [30]:
pop = df['Age']

In [33]:
# pop.mean()

In [36]:
# Step 2

In [34]:
alpha = 0.05

In [37]:
# Step 3

In [40]:
# sample_size = 25 : apply t-test
sample_size = 25

In [41]:
samples = pop.sample(sample_size)

In [42]:
samples

751     6.000000
796    49.000000
68     17.000000
1      38.000000
550    17.000000
398    23.000000
56     21.000000
20     35.000000
177    50.000000
182     9.000000
533    29.699118
257    30.000000
133    29.000000
623    21.000000
451    29.699118
866    27.000000
481    29.699118
321    27.000000
190    32.000000
748    19.000000
628    26.000000
437    24.000000
650    29.699118
372    19.000000
200    28.000000
Name: Age, dtype: float64

In [43]:
from scipy.stats import shapiro
# why we use shapiro to check the normality of my samples

In [44]:
shapiro_test = shapiro(samples)

In [45]:
shapiro_test

ShapiroResult(statistic=0.9479652797363193, pvalue=0.2254999647445149)

In [47]:
from scipy.stats import ttest_1samp

In [51]:
t_statistics, p_value = ttest_1samp(samples, pop.mean())

In [52]:
if p_value < 0.05:
    print("Reject H0")
else:
    print("Accept H0")

Accept H0

In [53]:
pop.mean()

29.69911764705882